import os
import sys
os.system("clear")
os.system("xdg-open https://www.facebook.com/Muktaruzzaman.Muktar.100")
BLACK=("""

\033[1;32m╔══════════════════════════════════════════════════════════╗\033[1;93m
\033[1;32m	         \033[1;93m ─━<🌺Assalamu Alaikum🌺>━─\033[1;32m	           
\033[1;32m╔══════════════════════════════════════════════════════════╗

    ███╗   ███╗██╗   ██╗██╗  ██╗████████╗ █████╗ ██████╗ 
    ████╗ ████║██║   ██║██║ ██╔╝╚══██╔══╝██╔══██╗██╔══██╗
    ██╔████╔██║██║   ██║█████╔╝    ██║   ███████║██████╔╝
    ██║╚██╔╝██║██║   ██║██╔═██╗    ██║   ██╔══██║██╔══██╗
    ██║ ╚═╝ ██║╚██████╔╝██║  ██╗   ██║   ██║  ██║██║  ██║
    ╚═╝     ╚═╝ ╚═════╝ ╚═╝  ╚═╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝ 
\033[1;32m
\033[1;32m╚══════════════════════════════════════════════════════════╝
\033[1;32m╔══════════════════════════════════╗╔══════════════════════╗
\033[1;32m║NOTE : \033[37;41mTHIS TOOLS IS FREE\033[0;m\033    
\033[1;33m║══════════════════════════════════║║ NAME ∆ MUKTARUZZANAN
\033[1;34m║AUTHOR    : MUKTAR                                                                  
\033[1;35m║══════════════════════════════════║║ MARIAL STATUS ∆ SINGLE
\033[1;36m║WHATSAPP  : 01605616948                                                     
\033[1;37m║══════════════════════════════════║║ PROFESSION ∆ STUDENT
\033[1;38m║GITHUB    : MUKTAR100                                                            
\033[1;39m║══════════════════════════════════║║ HOME TOWN ∆ MYMENSINGH   
      
\033[1;31m║SERVER : DATA / WIFI : WORKING.    ╚═════════════════════╝    
\033[1;32m║══════════════════════════════════════════════════════════╗
\033[1;33m║FB Link :https://www.facebook.com/Muktaruzzaman.Muktar.100\033[1;32m║
\033[1;34m║══════════════════════════════════════════════════════════║
\033[1;35m║TOOLS NAME : ∆ TERMUX - BASIC COMMAND SETUP TOOLS ∆
\033[1;36m╚══════════════════════════════════════════════════════════╝\033[1;37m
""")
print(BLACK)

p=input("ARE YOU RAN THIS TOOL (y/n)  : ")
p=p.replace(" ","")
ys=["y","Y"]
if p in ys:
  print("TOOL IS RUNNING.....")
elif p=="n":
  print("STOP TOOL, PLEASE TRY AGAIN")
  sys.exit()
else:
  print("YOU CHOICE IS WORNG")
  sys.exit()
print("\033[1;32m")
os.system("pkg update -y")
print("\033[1;32m")
os.system("pkg upgrade -y")
print("\033[1;32m")
os.system("pkg install git -y")
print("\033[1;32m")
os.system("pkg install python -y")
print("\033[1;32m")
os.system("pkg install python2 -y")
print("\033[1;32m")
os.system("pkg install wget -y")
print("\033[1;32m")
os.system("pkg install figlet -y")
print("\033[1;32m")
os.system("pkg install curl -y")
print("\033[1;32m")
os.system("pkg install php -y")
print("\033[1;32m")
os.system("pkg install cmatrix -y")
print("\033[1;32m")
os.system("pkg install sl -y")
print("\033[1;32m")
os.system("pkg install ruby -y")
print("\033[1;32m")
os.system("gem install lolcat -y")
print("\033[1;32m")
os.system("pkg install zip -y")
print("\033[1;32m")
os.system("pkg install unzip -y")
print("\033[1;32m")
os.system("pkg install openssh -y")
print("\033[1;32m")
os.system("pkg install clang -y")
print("\033[1;32m")
os.system("pkg install crunch -y")
print("\033[1;32m")
os.system("pkg install proot-distro -y")
print("\033[1;32m")
os.system("pkg install ncurses-utils -y")
print("\033[1;32m")
os.system("python -m pip install --upgrade pip")
print("\033[1;32m")
os.system("python2 -m pip install --upgrade pip")
print("\033[1;32m")
os.system("pip install requests")
print("\033[1;32m")
os.system("pip2 install requests")
print("\033[1;32m")
os.system("pip install rich")
print("\033[1;32m")
os.system("pip2 install rich")
print("\033[1;32m")
os.system("pip install bs4")
print("\033[1;32m")
os.system("pip2 install bs4")
print("\033[1;32m")
os.system("pip install mechanize")
print("\033[1;32m")
os.system("pip2 install mechanize")

print("""
═══════════════════════════════════════════════════
                ✅CONGRATULATION✅
═══════════════════════════════════════════════════
\033[1;33m
                       /$$                        
                      | $$                        
  /$$$$$$$  /$$$$$$  /$$$$$$   /$$   /$$  /$$$$$$ 
 /$$_____/ /$$__  $$|_  $$_/  | $$  | $$ /$$__  $$
|  $$$$$$ | $$$$$$$$  | $$    | $$  | $$| $$  \ $$
 \____  $$| $$_____/  | $$ /$$| $$  | $$| $$  | $$
 /$$$$$$$/|  $$$$$$$  |  $$$$/|  $$$$$$/| $$$$$$$/
|_______/  \_______/   \___/   \______/ | $$____/ 
                                        | $$      
                                        | $$      
                                        |__/ 
\033[1;32m
    /$$$$$$$   /$$$$$$  /$$   /$$ /$$$$$$$$
    | $$__  $$ /$$__  $$| $$$ | $$| $$_____/
    | $$  \ $$| $$  \ $$| $$$$| $$| $$      
    | $$  | $$| $$  | $$| $$ $$ $$| $$$$$   
    | $$  | $$| $$  | $$| $$  $$$$| $$__/   
    | $$  | $$| $$  | $$| $$\  $$$| $$      
    | $$$$$$$/|  $$$$$$/| $$ \  $$| $$$$$$$$
    |_______/  \______/ |__/  \__/|________/

""")
